[
    {
        "catgorizeComment": "Good Review",
        "comment": "It is very good product. It's picture quality is very good.USB working fine for Pen drive as well as USB hard disk also. I have used with 1 TB hard disk,working properly.I would like to also comment regarding delivery. Only one day is taken to delivery this product and Engineer deployed on time.READ MORE"
    },
    {
        "catgorizeComment": "Delightful experience buying and using",
        "comment": "Flipkart does spoil you. With a super-efficient service, prompt in a day delivery, courteous deliver folks and flexible enough to work with your timings, it was indeed a delightful experience. The TV was well packed and promptly delivered. Installation was a breeze. The TV is really nice and has a very good quality picture.  It is just two days old, but I can already see that it is a good addition to my house and will be enjoyed by all in the family. The TV is very light weight and has a ve...READ MORE"
    },
    {
        "catgorizeComment": "Honest Review......",
        "comment": "OK, first of all I did not received the full working TV at the first time. Only one speaker was working!.So i placed a replacement request and after 7-8 days i got my product replaced.Now talking about the Pros and Cons-Pros-1.The Price-Got it for 13289 on TV days.2.Picture-The picture quality is really nice. You just need to tweak the settings a little bit and boom! You will get nice contrast and saturation.I recommend to connect Videocon D2H HD with it.3.Headphone Connectivity-It offers...READ MORE"
    },
    {
        "catgorizeComment": "MV TV",
        "comment": "VERY GOOD PERFORMACE  & CLARITY OF PICTURE.  I, AM HAPPY THAT I,BOUGHT THIS   CHENNAI -  08/03/2016                                                  S,ARUNACHALAM.READ MORE"
    },
    {
        "catgorizeComment": "Just wow!",
        "comment": "Gives stunning picture quality I bought this TV 2 months ago and I am completely satisfied with it. Works much better with tata sky HD picture and sound quality is too good Certainly deserves much appreciation that what it worths Simply go for it or regretREAD MORE"
    },
    {
        "catgorizeComment": "Good Deal!!!!!",
        "comment": "Got delivery before scheduled timing, thanks FlipKart !!!! About Product :-* Good Picture Quality (Color Reproduction)* Good Sound * Got 2 USB and 2 HDMI 1 - 3.5 mm Jack* Viewing angle also good* Slim & Thin Bezel * Price also too low as compare Samsung, Sony ,LG Brand* Giving 4 Star because its not Full HD.READ MORE"
    },
    {
        "catgorizeComment": "just awesome",
        "comment": "Got this tv for 10800/-- ..what can you expect more...it's beyond expectations...all video format works like charm...Just go for it....READ MORE"
    },
    {
        "catgorizeComment": "Awesome product in best price",
        "comment": "Wooow....TV is awesome and quality is also very good. Display and Sound is best.Design looks very good.READ MORE"
    },
    {
        "catgorizeComment": "woooowww..........",
        "comment": "Gives stunning picture quality I am completely satisfied with it. Works much better with tata sky HD picture and sound quality is too good Certainly deserves much appreciation that what it worths Simply go for it ........READ MORE"
    },
    {
        "catgorizeComment": "Perfect product!",
        "comment": "Seen samsung.sony lg all of them , compared a lot , confused myself even ..then i saw this product on flipcart...trust me..i m not those nakli customer who give review on paid adv...truely honest product in this price 12k...picture is clearer than lloyd samsung as i have both in my home...i m satisfied...READ MORE"
    },
    {
        "catgorizeComment": "Highly recommended",
        "comment": "Super TV & fast delivery & fast installation from Flipkart as usual,I bought this Vu 32 TV at 1-Nov-2015, iam writing this review after 11 months usage still no problem working very well, I really satisfied with this TV , but before I planned to buy a led TV i think too much about this brand, because it is a new brand in Indian market , shall I go with this brand or not and thinking about leading brands like sony , lg, Samsung but my budget is low and this brands 32 inches TV cost from 20,0...READ MORE"
    },
    {
        "catgorizeComment": "Could be way better",
        "comment": "goodREAD MORE"
    },
    {
        "catgorizeComment": "Absolutely Stunning, Incredible service from Flipkart",
        "comment": "At first i was unable to decide whether to go for Vu brand or not. The reason is obvious - It's not very well known brand, has deadly competitors and so on. I made a detailed investigation on the internet and finally ordered it from Flipkart.Believe me this product is beyond my expectations.Pros: - 1. Very sleek and ulra light weight.2. The sound is perfect.3. Picture quality is stunning. Pls go for HD service from Dish Tv or others.Cons: - Still looking for it...READ MORE"
    },
    {
        "catgorizeComment": "Awesome product",
        "comment": "Awesome product in this price range.. Great picture quality and sound like Sony and Samsung.Buyer should buy this TVREAD MORE"
    },
    {
        "catgorizeComment": "Everything fine except the 3.5mm audio plug out",
        "comment": "Overall everything fine except the 3.5mm audio plug out. When I connect my speaker to it, it gives a hissss sound.READ MORE"
    }
]